#coding:utf-8
内部排序 在内存中进行排序
外部排序 数据量太大，不在内存中排序

1、插入排序
    直接插入排序：前n-1个数已经排好序了，要把第n个数插入正确的位置
    输入 [48, 62, 35, 77, 55, 14, 35, 9]
    输出
    0 [48, 62, 35, 77, 55, 14, 35, 9]
    1 [48, 62, 35, 77, 55, 14, 35, 9]
    2 [35, 48, 62, 77, 55, 14, 35, 9]
    3 [35, 48, 62, 77, 55, 14, 35, 9]
    4 [35, 48, 55, 62, 77, 14, 35, 9]
    5 [14, 35, 48, 55, 62, 77, 35, 9]
    6 [14, 35, 35, 48, 55, 62, 77, 9]
    7 [9, 14, 35, 35, 48, 55, 62, 77]
    
def ins_sort(seq, i):
    '''
    递归版
    '''
    if i == 0:return
    ins_sort(seq, i-1)
    j = i
    while j>0 and seq[j-1] > seq[j]:
        seq[j-1],seq[j] = seq[j],seq[j-1]
        j -= 1
    print i,seq

def ins_sort2(seq):
    '''
    迭代版
    '''
    for i in range(len(seq)):
        j = i
        while j>0 and seq[j-1] > seq[j]:
            seq[j-1],seq[j] = seq[j],seq[j-1]
            j -= 1
        print i,seq 
        
        

        