"""
5 -1 = 4
4/2=2
2/2=1

5+1=6
6/2=3
3-1=2 3+1=4
2/2=1 4/2=2
      2/2=1

"""
def main(n):
    count = 0
    while n != 1:
        # # 剩下3个糖时，先放回1个，再平均分一次，所以要2次操作
        if n == 3:
            count += 2
            break
        if n % 2 != 0:
            # 奇数-1 次数小于等于 奇数+1
            # 当前的数平分后，如果是奇数就-1 偶数就+1
            if (n + 1) // 2 % 2 == 0:
                n += 1
            else:
                n - 1
            count += 1

        n //= 2
        count += 1
    print(count)


n = 5
main(n)
